import { z } from "zod";

export const authSchema = z.object({
  mobile: z.union([
    z.string({ required_error: "मोबईल नंबर टाका" }),
    z.string().regex(/^[0-9]*$/, "कृपया वैध ईमेल पत्ता प्रविष्ट करा"),
    z.string().regex(/^[a-z0-9]+@[a-z]+\.[a-z]{2,3}$/, "कृपया वैध ईमेल पत्ता प्रविष्ट करा"),
  ]),
  password: z
    .string({ required_error: "कृपया वैध पासवर्ड प्रविष्ट करा" })
    .min(8, "पासवर्डमध्ये कमीतकमी 8 वर्ण असावेत")
    .regex(/[a-z]/, "पासवर्डमध्ये एक लहान अक्षर असावा.")
    .regex(/[A-Z]/, "पासवर्डमध्ये एक मोठे अक्षर असावा.")
    .regex(/[0-9]/, "पासवर्डमध्ये एक संख्या असावी.")
    .regex(/[@$!%*?&]/, "पासवर्डमध्ये एक विशेष वर्ण असावा. (@,$)"),
});
